СРО_Копия/src/Reports/СРО_СводныйОтчетПоКПК/СРО_СводныйОтчетПоКПК.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>СРО_СводныйОтчетПоКПК</name>
</mdclass:Report>

СРО_Копия/src/Catalogs/Контрагенты/Контрагенты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Контрагенты</name>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеКраткое</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИНН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОГРН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРегистрацииКПК</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерВРеестреСРО</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВступленияВСРО</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИсключенияИзСРО</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Субъект</name>
    <type>
      <types>CatalogRef.СРО_Субъекты</types>
    </type>
  </attributes>
  <attributes>
    <name>УправлениеГУ</name>
    <type>
      <types>CatalogRef.СРО_УправленияГУ</types>
    </type>
  </attributes>
  <attributes>
    <name>ЛиквидацияБанкротство</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Район</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидДляСписка</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>ДействуетС</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Предписания</name>
    <attributes>
      <name>ДатаНачалаПредписания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончанияПредписания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

СРО_Копия/src/Reports/СРО_СводныйОтчетПоКПК/Forms/ФормаОтчета/Module.bsl
&НаКлиенте
процедура ОбновитьПредставлениеПериода()
	Если ВидОтчета = 0 Тогда
		НачалоПериода = НачалоКвартала(ДатаОкончанияОтчетногоПериода);
		ОкончаниеПериода = КонецКвартала(ДатаОкончанияОтчетногоПериода); 	
		Элементы.ДекорацияПериод.Заголовок =	ПредставлениеПериода(НачалоПериода, ОкончаниеПериода);
		
	КонецЕсли;
	
	Элементы.УменьшитьПериод.Видимость = ВидОтчета = 0;
	Элементы.УвеличитьПериод.Видимость = ВидОтчета = 0;
	Элементы.ДекорацияПериод.Видимость = ВидОтчета = 0;
	Элементы.ВыводитьТолькоКПКСОтчетностью.Видимость = ВидОтчета = 0;
	
	
	Элементы.ПериодОтчета.Видимость = ВидОтчета <> 0;
	Элементы.СписокКПК.Видимость = ВидОтчета <> 0;    
		
КонецПроцедуры   


&НаКлиенте
Процедура ПриИзмененииОтчетногоПериода(Режим)
	
	Знак = ?(Режим = "Увеличить", 1, -1);   	
	КоличествоМесяцев = 3;				 
	ДатаОкончанияОтчетногоПериода =  НачалоДня(КонецКвартала(ДобавитьМесяц(ДатаОкончанияОтчетногоПериода, КоличествоМесяцев * Знак)));			
	ОбновитьПредставлениеПериода();		
КонецПроцедуры

&НаКлиенте
Процедура УменьшитьПериод(Команда)
	ПриИзмененииОтчетногоПериода("Уменьшить");     
КонецПроцедуры

&НаКлиенте
Процедура УвеличитьПериод(Команда)
	ПриИзмененииОтчетногоПериода("Увеличить");    
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если НЕ ЗначениеЗаполнено(ДатаОкончанияОтчетногоПериода) Тогда
		ДатаОкончанияОтчетногоПериода =  КонецКвартала(ДобавитьМесяц(ТекущаяДата(), -3));
	КонецЕсли;
	
	ОбновитьПредставлениеПериода();
	
	Если ВидОтбора_КПК_УправлениеГУ = "" Тогда
		ВидОтбора_КПК_УправлениеГУ = "КПК";		
	КонецЕсли;
	
	ВидОтбора_КПК_УправлениеГУПриИзменении("");    

КонецПроцедуры

&НаСервере  
Процедура СформироватьНаСервере()
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	
	ЭтотОбъект.Результат.Очистить();
	
	МассивКПК = СписокКПК.ВыгрузитьЗначения();	 	
	МассивУправленийГУ = СписокУправленийГУ.ВыгрузитьЗначения();	 

	
	Если ВидОтчета = 0 Тогда
		ДатаНачалаОтчета    = НачалоКвартала(ДатаОкончанияОтчетногоПериода);
		ДатаОкончанияОтчета = ДатаОкончанияОтчетногоПериода;
	Иначе
		ДатаНачалаОтчета  = ПериодОтчета.ДатаНачала;
		ДатаОкончанияОтчета = КонецМесяца(ПериодОтчета.ДатаОкончания);     	
	КонецЕсли;
		
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ДатаНачалаОтчета", ДатаНачалаОтчета);
	СтруктураПараметров.Вставить("ДатаОкончанияОтчета", ДатаОкончанияОтчета);
	СтруктураПараметров.Вставить("МассивКПК", МассивКПК);
	СтруктураПараметров.Вставить("МассивУправленийГУ", МассивУправленийГУ);
	СтруктураПараметров.Вставить("ВидОтбора_КПК_УправлениеГУ", ВидОтбора_КПК_УправлениеГУ);
	СтруктураПараметров.Вставить("ВыводитьТолькоКПКСОтчетностью", ВыводитьТолькоКПКСОтчетностью);
	СтруктураПараметров.Вставить("ВидОтчета", ВидОтчета);

	МассивТабДокументов = Отчеты.СРО_СводныйОтчетПоКПК.СформироватьТабличныеДокументы(СтруктураПараметров);
	
	Результат.Вывести(МассивТабДокументов[0]);
	//Возврат МассивТабДокументов;	
	
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)       	

	СформироватьНаСервере();

	//ТабличныйДокумент = СформироватьНаСервере();
	//Результат.Вывести(ТабличныйДокумент);
	
КонецПроцедуры

&НаКлиенте
Процедура ВидОтчетаПриИзменении(Элемент)
	ОбновитьПредставлениеПериода(); 
	ВидОтбора_КПК_УправлениеГУПриИзменении("");

КонецПроцедуры

&НаКлиенте
Процедура РезультатОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка, ДополнительныеПараметры)
	Если ТипЗнч(Расшифровка) = Тип("ДокументСсылка.ОтчетностьКПК") ИЛИ ТипЗнч(Расшифровка) = Тип("СправочникСсылка.Контрагенты") Тогда
		СтандартнаяОбработка = Ложь;    
		ОбработкаРасшифровки(Расшифровка);   
	КонецЕсли;  	

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаРасшифровки(ДокументОтчетности)
	СписокДействий = Новый СписокЗначений;
	СписокДействий.Добавить("ОткрытьСправочник", "Открыть справочник КПК");
	Если ТипЗнч(ДокументОтчетности) = Тип("ДокументСсылка.ОтчетностьКПК") Тогда
		СписокДействий.Добавить("ОткрытьДокументОтчетности", "Открыть документ отчетности");
	КонецЕсли;
	
	ДополнительныеПараметры = Новый Структура("ДокументОтчетности", ДокументОтчетности);
	
	ОповещениеПослеВыбораДействиярасшифровки = Новый ОписаниеОповещения("ПослеВыбораДействияРасшифровки", ЭтаФорма, ДополнительныеПараметры);		
	СписокДействий.ПоказатьВыборЭлемента(ОповещениеПослеВыбораДействиярасшифровки, "", СписокДействий[0]);  	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораДействияРасшифровки(Элемент, Параметры) Экспорт

	Если Элемент = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Элемент.Значение = "ОткрытьСправочник" Тогда
		
		Если ТипЗнч(Параметры.ДокументОтчетности) = Тип("ДокументСсылка.ОтчетностьКПК") Тогда
			Пар = Новый Структура("Ключ", ПолучитьКПКДокумента(Параметры.ДокументОтчетности));
		Иначе
			Пар = Новый Структура("Ключ", Параметры.ДокументОтчетности);
		КонецЕсли;
			
		ОткрытьФорму("Справочник.Контрагенты.Форма.ФормаЭлемента", Пар);
	ИначеЕсли Элемент.Значение = "ОткрытьДокументОтчетности" Тогда
		Пар = Новый Структура("Ключ", Параметры.ДокументОтчетности);
		ОткрытьФорму("Документ.ОтчетностьКПК.Форма.ФормаДокумента", Пар);   			
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьКПКДокумента(ВыбДокумент)
	Если ТипЗнч(ВыбДокумент) = Тип("ДокументСсылка.ОтчетностьКПК") 
		ИЛИ ТипЗнч(ВыбДокумент) = Тип("ДокументОбъект.ОтчетностьКПК") Тогда
		Возврат ВыбДокумент.КПК;
	Иначе
		Возврат Неопределено;		
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ВидОтбора_КПК_УправлениеГУПриИзменении(Элемент)
	Если ВидОтчета = 0 Тогда
		Элементы.СписокУправленийГУ.Видимость = Ложь;		
		Элементы.СписокКПК.Видимость = Ложь;
		Элементы.ВидОтбора_КПК_УправлениеГУ.Видимость = Ложь;
	Иначе	
		Элементы.СписокУправленийГУ.Видимость = НЕ ВидОтбора_КПК_УправлениеГУ = "КПК";		
		Элементы.СписокКПК.Видимость = ВидОтбора_КПК_УправлениеГУ = "КПК";		
		Элементы.ВидОтбора_КПК_УправлениеГУ.Видимость = Истина;

	КонецЕсли;

КонецПроцедуры
